<template>
  <div class="bui_p_48">
    <div class="bui_row_p_32">
      <!-- 文字裁剪 -->
      <com-title title="水平分布" info="Horizontal layout"></com-title>
      <p>
        使用预设类
        <bui-badge size="24">.bui_line_clamp_*</bui-badge>
        快速构造文本裁剪样式
      </p>
      <div>
        <bui-btn-group v-model="num" size="24">
          <option value="">不限</option>
          <option v-for="i in 10" :key="i" :value="i">{{ i + '行' }}</option>
        </bui-btn-group>
      </div>
      <div>
        <p class="bui_fs_12 bui_fc_silver_d bui_p_6_b">bui_line_clamp_{{ num }}</p>
        <div class="bui_p_24 bui_bgc_silver_l bui_fs_12"><p :class="'bui_line_clamp_' + num" v-html="value"></p></div>
      </div>
      <p>具体使用方式请见下方代码演示</p>
      <bui-code>
        <pre><template v-for="i in 10">&lt;p class="bui_line_clamp_{{i}}"&gt;......&lt;/p&gt;
</template></pre>
      </bui-code>
      <!-- 文字裁剪 -->
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      num: 1,
      value:
        '一、黄巾起义 群雄逐鹿东汉末年，皇帝昏聩无能，宦官专权，朝廷腐败。百姓苦不堪言，爆发了大型农民起义——黄巾起义。乱世之中，一代枭雄与英雄人物竞相涌现。大将军何进在与十常侍的斗争中被杀，袁绍和曹操领众诸侯以平“十常侍之乱”为名冲入皇宫，剿杀宦官。在保护汉少帝的过程中，西凉刺史董卓引兵入关随即掌控朝中大权，废汉少帝，立陈留王刘协为汉献帝。生性残暴的董卓倒行逆施，引发多方愤然。曹操假借圣旨之名，召集十八路诸侯联合讨伐董卓。虎牢关前，桃园结义志在匡扶汉室的的刘备、关羽、张飞三兄弟大战吕布。讨董盟军声威浩大，迫使董卓挟汉献帝逃至长安，最终被司徒王允设连环计除掉。讨董盟军的各路诸侯心怀鬼胎，联盟开始分崩离析。袁绍欲谋取长沙太守孙坚手中的传国玉玺，设计使孙坚在逃避途中被荆州刘表袭击遇害。同时，袁绍在界桥之战中击败公孙瓒，占领河北。曹操广泛招贤纳才，成为中原一大势力。此时，群雄逐鹿的雏形初成。二、曹操得势 官渡之战汉朝末年黄巾起义形势汉朝末年黄巾起义形势董卓死后，曹操“挟天子以令诸侯”，迎汉献帝于许昌建都，并运用权谋相继除去了吕布、袁术、张绣等人，展现了非凡的政治军事能力。然而汉献帝不甘于被曹操胁迫，秘密联合董承、刘备等大臣意欲除掉曹操，却因事情泄露反遭其害，致使董承等人被杀，刘备侥幸逃脱，前往河北依附袁绍。在江东，孙坚之子孙策多年苦心经营，终于称霸江东六郡八十一州。孙策亡故后，其弟孙权继业。孙权在周瑜等人扶持下，为吴国的建立积聚了强大的实力。坐拥河北的袁绍以“衣带诏”为名，率领大军讨伐曹操，双方于官渡展开艰苦鏖战。袁军虽然势大，但内部勾心斗角，终于被背水一战的曹操击败。袁绍气病交加身亡，几个儿子又兄弟阋墙，被曹操设计分化一一除掉。曹操继而征伐乌桓一统北方，为此后魏国的建立奠定了坚实的基础。三、荆襄风云 赤壁之战刘备在汝南遭曹操战败，投奔荆州刘表。而后刘备三顾茅庐，请得足智多谋而又心怀天下的诸葛亮辅佐。曹操统一北方后开始举兵南征，矛头直指荆州。此时，刘表亡故，其长子刘琦不得重用。次子刘琮接管荆州后投降曹操，荆州落入曹操手中。刘备遭曹操沿途追杀，命悬一线，幸而有诸葛亮赵云等死命保全才得以存身。面对曹操南征之势，刘备遣诸葛亮往江东与孙权结盟。诸葛亮舌战群儒，最终促成孙、刘联军。在诸葛亮、周瑜、庞统、黄盖等文臣武将的合作下，通过反间计、连环计、苦肉计等一系列有步骤、有计划的行动，在赤壁一战中大破曹军，谱写了中国古代战争史上以少胜多的光辉篇章。赤壁大战过后，刘备、孙权转而争夺荆州。孙权遣鲁肃向刘备讨还荆州，刘备则在诸葛亮的劝谕下多次推辞。周瑜献计，欲骗刘备前往东吴迎娶孙权之妹孙尚香为妻，进而扣留刘备，威逼诸葛亮以荆州换之。不料周瑜的计谋都被诸葛亮屡屡识破，致使其“赔了夫人又折兵”。周瑜最终在诸葛亮的讥讽中呕血而亡，留下了“既生瑜，何生亮”的长叹。历经了半生的屈辱磨难之后，刘备真正拥有了自己的领地，为进军西川打下基础。'
    }
  },
  mounted() {
    var _t = this
  }
}
</script>

<style></style>
